public class Main {
    public static void main(String[] args) {
        //Задача 1
        System.out.println("Задача 1");

        int clientOS = 12;
        if (clientOS == 1) {
            System.out.println("Установите версию приложения для Android по ссылке");
        } else if (clientOS == 0) {
            System.out.println("Установите версию приложения для iOS по ссылке");
        }


    }
}